Hi folks 👋 Available in [Terraform 0.12.2](https://github.com/hashicorp/terraform/blob/master/CHANGELOG.md#0122-june-12-2019) and later, there is now native support for a subset of YAML's functionality in Terraform configurations via the [`yamldecode()`](https://www.terraform.io/docs/configuration/functions/yamldecode.html) and [`yamlencode()`](https://www.terraform.io/docs/configuration/functions/yamlencode.html) built-in functions. In the case of this resource, we just need to decode the YAML and ensure its encoded as JSON which is the ECS API requirement. The typing of elements must match ECS requirements.

As a contrived example with multi-line heredoc syntax, given this configuration:

```hcl
terraform {
  required_providers {
    aws = ">= 2.7.0"
  }

  required_version = ">= 0.12.2"
}

provider "aws" {
  region = "us-east-2"
}

resource "aws_ecs_task_definition" "example" {
  family = "3153example"

  container_definitions = jsonencode(yamldecode(<<TASK
- name: sleep
  image: busybox
  cpu: 10
  command:
  - sleep
  - "360"
  memory: 10
  essential: true
TASK
  ))
}
```

Successfully applies with:

```console
$ terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_ecs_task_definition.example will be created
  + resource "aws_ecs_task_definition" "example" {
      + arn                   = (known after apply)
      + container_definitions = jsonencode(
            [
              + {
                  + command   = [
                      + "sleep",
                      + "360",
                    ]
                  + cpu       = 10
                  + essential = true
                  + image     = "busybox"
                  + memory    = 10
                  + name      = "sleep"
                },
            ]
        )
      + family                = "3153example"
      + id                    = (known after apply)
      + network_mode          = (known after apply)
      + revision              = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_ecs_task_definition.example: Creating...
aws_ecs_task_definition.example: Creation complete after 1s [id=3153example]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```

Hope this helps! For further feature requests or bug reports with the new general YAML configuration handling within in Terraform, please open an issue upstream in Terraform Core, where it is implemented: https://github.com/hashicorp/terraform/issues